const cards = [

{
    category: "النسب",
    question: "لماذا من المهم حفظ ومعرفة نسب النبي ﷺ؟",
    options: [
        "لفهم أحداث السيرة ومعرفة الأنساب",
        "لمعرفة أسماء الصحابة فقط",
        "لأن النسب أهم من الأخلاق",
        "لأجل التجارة"
    ],
    correct: 0
},

{
    category: "الإرهاصات",
    question: "ما معنى الإرهاصات؟",
    options: [
        "المقدمات التي تسبق أمرًا عظيمًا",
        "الأحداث التي تقع بعد الهجرة",
        "أسماء الصحابة",
        "أنواع العبادة"
    ],
    correct: 0
},

{
    category: "أصحاب الفيل",
    question: "من هو أبرهة؟",
    options: [
        "ملك الحبشة",
        "النائب العام للنجاشي في اليمن",
        "أحد الصحابة",
        "زعيم قريش"
    ],
    correct: 1
},

{
    category: "أصحاب الفيل",
    question: "ما اسم الفيل الذي جاء به أبرهة؟",
    options: [
        "محمود",
        "الفيل الكبير",
        "أسد",
        "سعد"
    ],
    correct: 0
},

{
    category: "أصحاب الفيل",
    question: "أكملي العبارة: أنا رب الإبل و...",
    options: [
        "للبيت رب يحميه",
        "الله معنا",
        "مكة لنا",
        "لن أترك الإبل"
    ],
    correct: 0
},

{
    category: "ولادة النبي ﷺ",
    question: "متى ولد النبي ﷺ؟",
    options: [
        "عام الفيل",
        "عام الحزن",
        "بعد الهجرة",
        "عام بدر"
    ],
    correct: 0
},

{
    category: "المرضعات",
    question: "من هي المرضعة الثانية للنبي ﷺ؟",
    options: [
        "آمنة بنت وهب",
        "حليمة السعدية",
        "خديجة رضي الله عنها",
        "فاطمة رضي الله عنها"
    ],
    correct: 1
},

{
    category: "شق الصدر",
    question: "ما الحكمة من حادثة شق الصدر؟",
    options: [
        "تقوية قلب النبي ﷺ وإعداده لتحمل أعباء الرسالة",
        "تهيئة النبي ﷺ لمواجهة التحديات منذ صغره",
        "التطهير من حظ الشيطان وإعداد النبي ﷺ للعصمة",
        "إظهار مكانة النبي ﷺ وخصوصيته بين الناس"
    ],
    correct: 2
},

{
    category: "الكفالة",
    question: "من كفل النبي ﷺ بعد وفاة أمه؟",
    options: [
        "أبو طالب",
        "عبد الله بن عبد المطلب",
        "جده عبد المطلب",
        "أبو بكر"
    ],
    correct: 2
},

{
    category: "الكفالة",
    question: "من كفل النبي ﷺ بعد وفاة جده؟",
    options: [
        "عمه العباس",
        "أبو بكر",
        "حمزة بن عبد المطلب",
        "عمه أبو طالب",
    ],
    correct: 3
},

{
    category: "رعي الغنم",
    question: "ما فوائد رعي الغنم؟",
    options: [
        "التعرف إلى حياة البادية ومخالطة الناس",
        "اكتساب القوة وتحمل المشقة",
        "الصبر والحلم والرحمة والتدريب على قيادة الأمة",
        "تعلم التجارة وتنمية الخبرة في البيع والشراء"
    ],
    correct: 2
},

{
    category: "سلمان الفارسي",
    question: "ما العلامات الثلاث التي عرف بها سلمان النبي ﷺ؟",
    options: [
        "يقبل الهدية ولا يأكل الصدقة وبين كتفيه خاتم النبوة",
        "كان طويلًا وقويًا وشجاعًا",
        "كان تاجرًا ويعيش في مكة",
        "كان من قريش"
    ],
    correct: 0
},

{
    category: "الجاهلية",
    question: "من الذي أدخل عبادة الأصنام إلى مكة؟",
    options: [
        "أبرهة",
        "عمرو بن لحي",
        "أبو طالب",
        "عبد المطلب"
    ],
    correct: 1
},


{
    category: "الحالة الاجتماعية",
    question: "ما المقصود بوأد البنات؟",
    options: [
        "تزويج البنات مبكرًا",
        "تعليم البنات",
        "دفن البنات وهن أحياء",
        "إبعاد البنات عن القبيلة"
    ],
    correct: 2
},

{
    category: "الأخلاق",
    question: "ما أبرز الصفات الحسنة عند العرب في الجاهلية؟",
    options: [
        "الكرم والوفاء والشجاعة وحماية الجار",
        "الظلم والغدر",
        "الكذب والخيانة",
        "الكسل والجبن"
    ],
    correct: 0
},
{
    category: "بداية الوحي",
    question: "كم كان عمر النبي ﷺ عندما أتاه جبريل عليه السلام؟",
    options: [
        "30 سنة",
        "35 سنة",
        "40 سنة",
        "45 سنة"
    ],
    correct: 2
},

{
    category: "بداية الوحي",
    question: "ما أول سورة نزلت على النبي ﷺ؟",
    options: [
        "سورة ٱلۡمُدَّثِّرُ",
        "سورة العلق",
        "سورة الضحى",
        "سورة النحل"
    ],
    correct: 1
},

{
    category: "الدعوة السرية",
    question: "ما مدة الدعوة السرية؟",
    options: [
        "سنتان",
        "3 سنوات",
        "4 سنوات",
        "6 سنوات"
    ],
    correct: 1
},
{
    category: "الدعوة السرية",
    question: "في أي دار كان النبي ﷺ يجتمع بالمسلمين سرًّا ويرشدهم؟",
    options: [
        "دار أبي بكر",
        "دار خديجة",
        "دار الأرقم",
        "دار أبي طالب"
    ],
    correct: 2
},

{
    category: "دار الأرقم",
    question: "ما أبرز الموضوعات التي كان المسلمون يتلقونها في دار الأرقم؟",
    options: [
        "التجارة والسياسة",
        "أخبار العرب وأنسابهم",
        "العلم بالله والملائكة والأنبياء والآخرة والجنة والنار",
        "أحكام الجهاد فقط"
    ],
    correct: 2
},

{
    category: "الدعوة الجهرية",
    question: "على أي جبل صعد النبي ﷺ عندما بدأ دعوة الأقربين؟",
    options: [
        "جبل أحد",
        "جبل حراء",
        "جبل الصفا",
        "جبل ثور"
    ],
    correct: 2
},

{
    category: "الدعوة الجهرية",
    question: "ما موقف قريش من دعوة النبي ﷺ في الدعوة العامة؟",
    options: [
        "قبلوها مباشرة",
        "تجاهلوها فقط",
        "واجهوها بالسخرية والتكذيب وإثارة الشبهات والدعايات الكاذبة",
        "طلبوا منه الهجرة"
    ],
    correct: 2
},

{
    category: "بداية الوحي",
    question: "أين كان النبي ﷺ يتعبد قبل نزول الوحي؟",
    options: [
        "غار ثور",
        "غار حراء",
        "المسجد الحرام",
        "دار الأرقم"
    ],
    correct: 1
},

{
    category: "خديجة رضي الله عنها",
    question: "ما موقف خديجة رضي الله عنها عندما أخبرها النبي ﷺ أنه خشي على نفسه؟",
    options: [
        "خافت وتركته",
        "طلبت منه العودة إلى غار حراء",
        "طمأنته وذكرت له مكارم أخلاقه",
        "أخبرت قريشًا بما حدث"
    ],
    correct: 2
},

{
    category: "السجود عند تلاوة القرآن",
    question: "ما السورة التي تلاها النبي ﷺ على مسامع الكفار فسجدوا؟",
    options: [
        "سورة النحل",
        "سورة النجم",
        "سورة الناس",
        "سورة النساء"
    ],
    correct: 1
},

{
    category: "السابقون إلى الإسلام",
    question: "من أول من آمن من الصبيان؟",
    options: [
        "علي بن أبي طالب",
        "زيد بن حارثة",
        "الزبير بن العوام",
        "طلحة بن عبيد الله"
    ],
    correct: 0
}
];